app/controllers/api/v1/home_controller.rb

  def all
    user = User.all
---
SELECT "users".* FROM "users"