app/controllers/api/v1/passwords_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "refi@example.com"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 AND "users"."id" != $2 LIMIT $3  [["email", "refi@example.com"], ["id", 14], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."user" = $1 LIMIT $2  [["user", "refi@example.com"], ["LIMIT", 1]]
---
  def forgot
    # Check email ada atau tidak
    return render json: { error: 'Email not present' } if params[:email].blank?

    # Jika Email ada
    user = User.find_by(email: params[:email])

    if user.present?

SELECT  "users".* FROM "users" WHERE "users"."reset_password_token" = $1 LIMIT $2  [["reset_password_token", "6ba7c945c1e47e435bd6"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."reset_password_token" = $1 LIMIT $2  [["reset_password_token", "d92e7d6fab21a513352a"], ["LIMIT", 1]]
---
  def reset
    token = params[:token].to_s

    return render json: { error: 'Token not present' } if params[:email].blank?

    user = User.find_by(reset_password_token: token)

    if user.present? && user.password_token_valid?