app/controllers/api/v1/payment_details_controller.rb

SELECT "payment_details".* FROM "payment_details"
---
  def index
    @paydetail = PaymentDetail.all
    if @paydetail.present?

UPDATE "payment_details" SET "card_number" = $1, "cvv" = $2, "updated_at" = $3 WHERE "payment_details"."id" = $4  [["card_number", "111111111111111288888888888888"], ["cvv", "47623"], ["updated_at", "2018-12-12 07:04:45.549171"], ["id", 3]]
---
  def update
    if @paydetail.update(payment_details_params)

INSERT INTO "payment_details" ("card_number", "cvv", "isPaid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["card_number", "654321"], ["cvv", "476"], ["isPaid", false], ["created_at", "2018-12-12 02:35:55.719224"], ["updated_at", "2018-12-12 02:35:55.719224"]]
---
  def create
    @paydetail = PaymentDetail.new(payment_details_params)
    if @paydetail.save

SELECT  "payment_details".* FROM "payment_details" WHERE "payment_details"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def find_paymentdetail
    @paydetail = PaymentDetail.find_by(id: params[:id])