app/controllers/api/v1/product_invest_details_controller.rb

  def index
    proinvdetails = ProductInvestDetail.all
    if proinvdetails.present?
---
SELECT "product_invest_details".* FROM "product_invest_details"