app/controllers/api/v1/provinces_controller.rb

  def index
    provinces = Province.all
    if provinces.present?
---
SELECT  "provinces".* FROM "provinces" ORDER BY "provinces"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "provinces".* FROM "provinces"

  def show
    @prov = Province.find(params[:id])

    if @prov.present?
---
SELECT  "provinces".* FROM "provinces" WHERE "provinces"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "provinces".* FROM "provinces" WHERE "provinces"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def find_prov
    @prov = Province.find_by(id: params[:id])
---
SELECT  "provinces".* FROM "provinces" WHERE "provinces"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]