app/controllers/api/v1/sliders_controller.rb

  def index
    sliders = Slider.all
    if sliders.present?
---
SELECT "sliders".* FROM "sliders"

  def create
    slider = Slider.new(slider_params)
    if slider.save
---
INSERT INTO "sliders" ("name", "image", "url", "sort_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @slider = Slider.find(params[:id])
    @slider.image_url
    @slider.remove_image!
    update_slider = @slider.update(slider_params)
---
SELECT  "sliders".* FROM "sliders" WHERE "sliders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "sliders" SET "image" = $1, "updated_at" = $2 WHERE "sliders"."id" = $3  [["image", "sliders/udj5evbzrat0v231c6rb.jpeg"], ["updated_at", "2018-12-09 10:08:33.385325"], ["id", 2]]

  def destroy
    @slider = Slider.find(params[:id])
    if @slider.destroy!
---
SELECT  "sliders".* FROM "sliders" WHERE "sliders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "sliders" WHERE "sliders"."id" = $1  [["id", 1]]

  def find_slider
    @slider = Slider.find(params[:id])
---
SELECT  "sliders".* FROM "sliders" WHERE "sliders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]