app/controllers/api/v1/users_controller.rb

UPDATE "users" SET "last_login" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_login", "2018-11-29 06:31:04.243707"], ["updated_at", "2018-11-29 06:31:04.250436"], ["id", 12]]
---
  def current
    if current_user
      current_user.update!(last_login: Time.zone.now)

INSERT INTO "users" ("name", "email", "role", "created_at", "updated_at", "encrypted_password") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    user = User.new(user_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "kiki"], ["updated_at", "2018-12-07 03:36:30.866957"], ["id", 2]]
---
  def update
    user = User.find(params[:id])
    if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]
---
  def destroy
    user = User.find(params[:id])
    if user.role == 'admin'
      user.destroy