app/controllers/api/v1/user_investors_controller.rb

SELECT "user_investors".* FROM "user_investors"
---
  def index
    @userin = UserInvestor.all
    if @userin.present?

SELECT  "user_investors".* FROM "user_investors" WHERE "user_investors"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @userin = UserInvestor.find(params[:id])

INSERT INTO "user_investors" ("user_id", "investor_slot", "investor_pay", "invest_year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["investor_slot", 15], ["investor_pay", 150000000.0], ["invest_year", 10], ["created_at", "2018-12-09 15:55:23.242345"], ["updated_at", "2018-12-09 15:55:23.242345"]]
---
  def create
    @userin = UserInvestor.new(userin_params)
    if @userin.save

SELECT  "user_investors".* FROM "user_investors" WHERE "user_investors"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "user_investors" WHERE "user_investors"."id" = $1  [["id", 4]]
---
  def destroy
    @userin = UserInvestor.find(params[:id])
    if @userin.destroy